#### Terraform Format and Style 🖌`failure`
🚨 **Terraform Format failed!**
Please run `terraform fmt -recursive` and push the changes.

#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
module.kms.aws_kms_key.aurora: Refreshing state... [id=f66dcae2-5763-4f71-9f64-e7874ec8f6aa]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-01c67229f904be3d8]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.dynamodb.aws_dynamodb_table.main will be created
  + resource "aws_dynamodb_table" "main" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "business_transactions_table"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.iam.aws_iam_role.process_monetary_transactions_lambda_role will be created
  + resource "aws_iam_role" "process_monetary_transactions_lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "process_monetary_transactions_lambda_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role.sftp_user_role will be created
  + resource "aws_iam_role" "sftp_user_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "transfer.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sftp_user_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role_policy.sftp_user_policy will be created
  + resource "aws_iam_role_policy" "sftp_user_policy" {
      + id     = (known after apply)
      + name   = "sftp_user_policy"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.lambda.aws_lambda_function.process_monetary_transactions will be created
  + resource "aws_lambda_function" "process_monetary_transactions" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "<path-to-lambda>"
      + function_name                  = "process_monetary_transactions"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + tracing_config (known after apply)
    }

  # module.lambda.aws_lambda_permission.s3_trigger will be created
  + resource "aws_lambda_permission" "s3_trigger" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "process_monetary_transactions"
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowS3Invoke"
      + statement_id_prefix = (known after apply)
    }

  # module.s3.aws_s3_bucket.sftp_bucket will be created
  + resource "aws_s3_bucket" "sftp_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "scrooge-bank-g3t3-sftp-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.transfer_family.aws_transfer_server.sftp_server will be created
  + resource "aws_transfer_server" "sftp_server" {
      + arn                    = (known after apply)
      + domain                 = "S3"
      + endpoint               = (known after apply)
      + endpoint_type          = "PUBLIC"
      + force_destroy          = false
      + host_key_fingerprint   = (known after apply)
      + id                     = (known after apply)
      + identity_provider_type = "SERVICE_MANAGED"
      + protocols              = [
          + "SFTP",
        ]
      + security_policy_name   = "TransferSecurityPolicy-2018-11"
      + tags_all               = (known after apply)

      + protocol_details (known after apply)
    }

  # module.transfer_family.aws_transfer_user.sftp_user will be created
  + resource "aws_transfer_user" "sftp_user" {
      + arn                 = (known after apply)
      + home_directory      = "/scrooge-bank-g3t3-sftp-bucket"
      + home_directory_type = "PATH"
      + id                  = (known after apply)
      + role                = (known after apply)
      + server_id           = (known after apply)
      + tags_all            = (known after apply)
      + user_name           = "sftp_user"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @yijiyap, Action: `pull_request`*